#### Concrete Members

---

|  |
| --- |
| Concrete Class   Properties   See Also |

The  Concrete  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CommonTintColor | The property labeled "Tint Color" from the "Concrete" schema. |
| Public property Static member | CommonTintToggle | The property labeled "Tint" from the "Concrete" schema. |
| Public property Static member | ConcreteBmMap | The property labeled "Image" from the "Concrete" schema. |
| Public property Static member | ConcreteBrightmode | The property labeled "Weathering" from the "Concrete" schema. |
| Public property Static member | ConcreteBumpAmount | The property labeled "Amount" from the "Concrete" schema. |
| Public property Static member | ConcreteBumpMap | The property labeled "Image" from the "Concrete" schema. |
| Public property Static member | ConcreteColor | The property labeled "Color" from the "Concrete" schema. |
| Public property Static member | ConcreteFinish | The property labeled "Type" from the "Concrete" schema. |
| Public property Static member | ConcreteSealant | The property labeled "Sealant" from the "Concrete" schema. |

# See Also

Concrete Class

Autodesk.Revit.DB.Visual Namespace